/*************************************************************************
	> File Name: 勾股数.cpp
	> Author: XH
	> Mail: X_H_fight@163.com 
	> Created Time: Wed 26 Apr 2017 07:19:32 PM CST
 ************************************************************************/


/*问题描述
　　勾股数是一组三个自然数，a < b < c，以这三个数为三角形的三条边能够形成一个直角三角形
　　输出所有a + b + c <= 1000的勾股数
　　a小的先输出；a相同的，b小的先输出。
输出格式
　　每行为一组勾股数，用空格隔开
样例输出
例如，结果的前三行应当是
3 4 5
5 12 13
6 8 10
*/


//条件：
//1.a < b < c, c为斜边，三角形成立：a + b > c;
//2.勾股数：a^2 + b^2 = c^2;
//3.a + b + c <= 1000;  由条件1，c < 500; 则a,b也<500;
#include<iostream>
using namespace std;

int main()
{
	int a;
	int b;
	int c;

	//最小勾股数3，4，5
	for(a = 3; a < 500; ++a)
	{
		for( b = a+1; b < 500; ++b)
		{
			for(c = b+1; c < 500; ++c)
			{
				if(a + b <= c) //不是三角形
					break;
				if(a + b + c > 1000)
					break;
				if(a*a + b*b == c*c)
					cout << a << " " << b << " " << c << endl;
			}
		}
	}
	return 0;
}
